ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_lmem.h
/*
 * Constants & macros for individual LMEM_PCCLCR bitfields
 */

/*!
 * @name Register LMEM_PCCLCR, field LGO[0] (RW)
 *
 * Setting this bit initiates the cache line command indicated by bits 27-24.
 * Reading this bit indicates if a line command is active This bit stays set until
 * the command completes. Writing zero has no effect. This bit is shared with
 * CSAR[LGO]
 *
 * Values:
 * - 0 - Write: no effect. Read: no line command active.
 * - 1 - Write: initiate line command indicated by bits 27-24. Read: line
 *     command active.
 */
//@{
#define BP_LMEM_PCCLCR_LGO   (0U)          //!< Bit position for LMEM_PCCLCR_LGO.
#define BM_LMEM_PCCLCR_LGO   (0x00000001U) //!< Bit mask for LMEM_PCCLCR_LGO.
#define BS_LMEM_PCCLCR_LGO   (1U)          //!< Bit field size in bits for LMEM_PCCLCR_LGO.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCLCR_LGO field.
#define BR_LMEM_PCCLCR_LGO   (BITBAND_ACCESS32(HW_LMEM_PCCLCR_ADDR, BP_LMEM_PCCLCR_LGO))
#endif

//! @brief Format value for bitfield LMEM_PCCLCR_LGO.
#define BF_LMEM_PCCLCR_LGO(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCLCR_LGO), uint32_t) & BM_LMEM_PCCLCR_LGO)

#ifndef __LANGUAGE_ASM__
//! @brief Set the LGO field to a new value.
#define BW_LMEM_PCCLCR_LGO(v) (BITBAND_ACCESS32(HW_LMEM_PCCLCR_ADDR, BP_LMEM_PCCLCR_LGO) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PCCLCR, field CACHEADDR[11:2] (RW)
 *
 * CLCR[11:4] bits are used to access the tag arrays CLCR[11:2] bits are used to
 * access the data arrays
 */
//@{
#define BP_LMEM_PCCLCR_CACHEADDR (2U)      //!< Bit position for LMEM_PCCLCR_CACHEADDR.
#define BM_LMEM_PCCLCR_CACHEADDR (0x00000FFCU) //!< Bit mask for LMEM_PCCLCR_CACHEADDR.
#define BS_LMEM_PCCLCR_CACHEADDR (10U)     //!< Bit field size in bits for LMEM_PCCLCR_CACHEADDR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCLCR_CACHEADDR field.
#define BR_LMEM_PCCLCR_CACHEADDR (HW_LMEM_PCCLCR.B.CACHEADDR)
#endif

//! @brief Format value for bitfield LMEM_PCCLCR_CACHEADDR.
#define BF_LMEM_PCCLCR_CACHEADDR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCLCR_CACHEADDR), uint32_t) & BM_LMEM_PCCLCR_CACHEADDR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the CACHEADDR field to a new value.
#define BW_LMEM_PCCLCR_CACHEADDR(v) (HW_LMEM_PCCLCR_WR((HW_LMEM_PCCLCR_RD() & ~BM_LMEM_PCCLCR_CACHEADDR) | BF_LMEM_PCCLCR_CACHEADDR(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCLCR, field WSEL[14] (RW)
 *
 * Selects the way for line commands.
 *
 * Values:
 * - 0 - Way 0
 * - 1 - Way 1
 */
//@{
#define BP_LMEM_PCCLCR_WSEL  (14U)         //!< Bit position for LMEM_PCCLCR_WSEL.
#define BM_LMEM_PCCLCR_WSEL  (0x00004000U) //!< Bit mask for LMEM_PCCLCR_WSEL.
#define BS_LMEM_PCCLCR_WSEL  (1U)          //!< Bit field size in bits for LMEM_PCCLCR_WSEL.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCLCR_WSEL field.
#define BR_LMEM_PCCLCR_WSEL  (BITBAND_ACCESS32(HW_LMEM_PCCLCR_ADDR, BP_LMEM_PCCLCR_WSEL))
#endif

//! @brief Format value for bitfield LMEM_PCCLCR_WSEL.
#define BF_LMEM_PCCLCR_WSEL(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCLCR_WSEL), uint32_t) & BM_LMEM_PCCLCR_WSEL)

#ifndef __LANGUAGE_ASM__
//! @brief Set the WSEL field to a new value.
#define BW_LMEM_PCCLCR_WSEL(v) (BITBAND_ACCESS32(HW_LMEM_PCCLCR_ADDR, BP_LMEM_PCCLCR_WSEL) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PCCLCR, field TDSEL[16] (RW)
 *
 * Selects tag or data for search and read or write commands.
 *
 * Values:
 * - 0 - Data
 * - 1 - Tag
 */
//@{
#define BP_LMEM_PCCLCR_TDSEL (16U)         //!< Bit position for LMEM_PCCLCR_TDSEL.
#define BM_LMEM_PCCLCR_TDSEL (0x00010000U) //!< Bit mask for LMEM_PCCLCR_TDSEL.
#define BS_LMEM_PCCLCR_TDSEL (1U)          //!< Bit field size in bits for LMEM_PCCLCR_TDSEL.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCLCR_TDSEL field.
#define BR_LMEM_PCCLCR_TDSEL (BITBAND_ACCESS32(HW_LMEM_PCCLCR_ADDR, BP_LMEM_PCCLCR_TDSEL))
#endif

//! @brief Format value for bitfield LMEM_PCCLCR_TDSEL.
#define BF_LMEM_PCCLCR_TDSEL(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCLCR_TDSEL), uint32_t) & BM_LMEM_PCCLCR_TDSEL)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TDSEL field to a new value.
#define BW_LMEM_PCCLCR_TDSEL(v) (BITBAND_ACCESS32(HW_LMEM_PCCLCR_ADDR, BP_LMEM_PCCLCR_TDSEL) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PCCLCR, field LCIVB[20] (RO)
 *
 * If command used cache address and way, then this bit shows the initial state
 * of the valid bit If command used physical address and a hit, then this bit
 * shows the initial state of the valid bit. If a miss, this bit reads zero.
 */
//@{
#define BP_LMEM_PCCLCR_LCIVB (20U)         //!< Bit position for LMEM_PCCLCR_LCIVB.
#define BM_LMEM_PCCLCR_LCIVB (0x00100000U) //!< Bit mask for LMEM_PCCLCR_LCIVB.
#define BS_LMEM_PCCLCR_LCIVB (1U)          //!< Bit field size in bits for LMEM_PCCLCR_LCIVB.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCLCR_LCIVB field.
#define BR_LMEM_PCCLCR_LCIVB (BITBAND_ACCESS32(HW_LMEM_PCCLCR_ADDR, BP_LMEM_PCCLCR_LCIVB))
#endif
//@}

/*!
 * @name Register LMEM_PCCLCR, field LCIMB[21] (RO)
 *
 * If command used cache address and way, then this bit shows the initial state
 * of the modified bit If command used physical address and a hit, then this bit
 * shows the initial state of the modified bit. If a miss, this bit reads zero.
 */
//@{
#define BP_LMEM_PCCLCR_LCIMB (21U)         //!< Bit position for LMEM_PCCLCR_LCIMB.
#define BM_LMEM_PCCLCR_LCIMB (0x00200000U) //!< Bit mask for LMEM_PCCLCR_LCIMB.
#define BS_LMEM_PCCLCR_LCIMB (1U)          //!< Bit field size in bits for LMEM_PCCLCR_LCIMB.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCLCR_LCIMB field.
#define BR_LMEM_PCCLCR_LCIMB (BITBAND_ACCESS32(HW_LMEM_PCCLCR_ADDR, BP_LMEM_PCCLCR_LCIMB))
#endif
//@}

/*!
 * @name Register LMEM_PCCLCR, field LCWAY[22] (RO)
 *
 * Indicates the way used by the line command.
 */
//@{
#define BP_LMEM_PCCLCR_LCWAY (22U)         //!< Bit position for LMEM_PCCLCR_LCWAY.
#define BM_LMEM_PCCLCR_LCWAY (0x00400000U) //!< Bit mask for LMEM_PCCLCR_LCWAY.
#define BS_LMEM_PCCLCR_LCWAY (1U)          //!< Bit field size in bits for LMEM_PCCLCR_LCWAY.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCLCR_LCWAY field.
#define BR_LMEM_PCCLCR_LCWAY (BITBAND_ACCESS32(HW_LMEM_PCCLCR_ADDR, BP_LMEM_PCCLCR_LCWAY))
#endif
//@}

/*!
 * @name Register LMEM_PCCLCR, field LCMD[25:24] (RW)
 *
 * Values:
 * - 00 - Search and read or write
 * - 01 - Invalidate
 * - 10 - Push
 * - 11 - Clear
 */
//@{
#define BP_LMEM_PCCLCR_LCMD  (24U)         //!< Bit position for LMEM_PCCLCR_LCMD.
#define BM_LMEM_PCCLCR_LCMD  (0x03000000U) //!< Bit mask for LMEM_PCCLCR_LCMD.
#define BS_LMEM_PCCLCR_LCMD  (2U)          //!< Bit field size in bits for LMEM_PCCLCR_LCMD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCLCR_LCMD field.
#define BR_LMEM_PCCLCR_LCMD  (HW_LMEM_PCCLCR.B.LCMD)
#endif

//! @brief Format value for bitfield LMEM_PCCLCR_LCMD.
#define BF_LMEM_PCCLCR_LCMD(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCLCR_LCMD), uint32_t) & BM_LMEM_PCCLCR_LCMD)

#ifndef __LANGUAGE_ASM__
//! @brief Set the LCMD field to a new value.
#define BW_LMEM_PCCLCR_LCMD(v) (HW_LMEM_PCCLCR_WR((HW_LMEM_PCCLCR_RD() & ~BM_LMEM_PCCLCR_LCMD) | BF_LMEM_PCCLCR_LCMD(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCLCR, field LADSEL[26] (RW)
 *
 * When using the cache address, the way must also be specified in CLCR[WSEL].
 * When using the physical address, both ways are searched and the command is
 * performed only if a hit.
 *
 * Values:
 * - 0 - Cache address
 * - 1 - Physical address
 */
//@{
#define BP_LMEM_PCCLCR_LADSEL (26U)        //!< Bit position for LMEM_PCCLCR_LADSEL.
#define BM_LMEM_PCCLCR_LADSEL (0x04000000U) //!< Bit mask for LMEM_PCCLCR_LADSEL.
#define BS_LMEM_PCCLCR_LADSEL (1U)         //!< Bit field size in bits for LMEM_PCCLCR_LADSEL.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCLCR_LADSEL field.
#define BR_LMEM_PCCLCR_LADSEL (BITBAND_ACCESS32(HW_LMEM_PCCLCR_ADDR, BP_LMEM_PCCLCR_LADSEL))
#endif

//! @brief Format value for bitfield LMEM_PCCLCR_LADSEL.
#define BF_LMEM_PCCLCR_LADSEL(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCLCR_LADSEL), uint32_t) & BM_LMEM_PCCLCR_LADSEL)

#ifndef __LANGUAGE_ASM__
//! @brief Set the LADSEL field to a new value.
#define BW_LMEM_PCCLCR_LADSEL(v) (BITBAND_ACCESS32(HW_LMEM_PCCLCR_ADDR, BP_LMEM_PCCLCR_LADSEL) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PCCLCR, field LACC[27] (RW)
 *
 * Values:
 * - 0 - Read
 * - 1 - Write
 */
//@{
#define BP_LMEM_PCCLCR_LACC  (27U)         //!< Bit position for LMEM_PCCLCR_LACC.
#define BM_LMEM_PCCLCR_LACC  (0x08000000U) //!< Bit mask for LMEM_PCCLCR_LACC.
#define BS_LMEM_PCCLCR_LACC  (1U)          //!< Bit field size in bits for LMEM_PCCLCR_LACC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCLCR_LACC field.
#define BR_LMEM_PCCLCR_LACC  (BITBAND_ACCESS32(HW_LMEM_PCCLCR_ADDR, BP_LMEM_PCCLCR_LACC))
#endif

//! @brief Format value for bitfield LMEM_PCCLCR_LACC.
#define BF_LMEM_PCCLCR_LACC(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCLCR_LACC), uint32_t) & BM_LMEM_PCCLCR_LACC)

#ifndef __LANGUAGE_ASM__
//! @brief Set the LACC field to a new value.
#define BW_LMEM_PCCLCR_LACC(v) (BITBAND_ACCESS32(HW_LMEM_PCCLCR_ADDR, BP_LMEM_PCCLCR_LACC) = (v))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_LMEM_PCCSAR - Cache search address register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_LMEM_PCCSAR - Cache search address register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CSAR register is used to define the explicit cache address or the
 * physical address for line-sized commands specified in the CLCR[LADSEL] bit.
 */
typedef union _hw_lmem_pccsar
{
    uint32_t U;
    struct _hw_lmem_pccsar_bitfields
    {
        uint32_t LGO : 1;              //!< [0] Initiate Cache Line Command
        uint32_t RESERVED0 : 1;        //!< [1]
        uint32_t PHYADDR : 30;         //!< [31:2] Physical Address
    } B;
} hw_lmem_pccsar_t;
#endif

/*!
 * @name Constants and macros for entire LMEM_PCCSAR register
 */
//@{
#define HW_LMEM_PCCSAR_ADDR      (REGS_LMEM_BASE + 0x8U)

#ifndef __LANGUAGE_ASM__
#define HW_LMEM_PCCSAR           (*(__IO hw_lmem_pccsar_t *) HW_LMEM_PCCSAR_ADDR)
#define HW_LMEM_PCCSAR_RD()      (HW_LMEM_PCCSAR.U)
#define HW_LMEM_PCCSAR_WR(v)     (HW_LMEM_PCCSAR.U = (v))
#define HW_LMEM_PCCSAR_SET(v)    (HW_LMEM_PCCSAR_WR(HW_LMEM_PCCSAR_RD() |  (v)))
#define HW_LMEM_PCCSAR_CLR(v)    (HW_LMEM_PCCSAR_WR(HW_LMEM_PCCSAR_RD() & ~(v)))
#define HW_LMEM_PCCSAR_TOG(v)    (HW_LMEM_PCCSAR_WR(HW_LMEM_PCCSAR_RD() ^  (v)))
#endif
//@}

