ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_lmem.h
/*
 * Constants & macros for individual LMEM_PCCSAR bitfields
 */

/*!
 * @name Register LMEM_PCCSAR, field LGO[0] (RW)
 *
 * Setting this bit initiates the cache line command indicated by bits 27-24.
 * Reading this bit indicates if a line command is active This bit stays set until
 * the command completes. Writing zero has no effect. This bit is shared with
 * CLCR[LGO]
 *
 * Values:
 * - 0 - Write: no effect. Read: no line command active.
 * - 1 - Write: initiate line command indicated by bits CLCR[27:24]. Read: line
 *     command active.
 */
//@{
#define BP_LMEM_PCCSAR_LGO   (0U)          //!< Bit position for LMEM_PCCSAR_LGO.
#define BM_LMEM_PCCSAR_LGO   (0x00000001U) //!< Bit mask for LMEM_PCCSAR_LGO.
#define BS_LMEM_PCCSAR_LGO   (1U)          //!< Bit field size in bits for LMEM_PCCSAR_LGO.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCSAR_LGO field.
#define BR_LMEM_PCCSAR_LGO   (BITBAND_ACCESS32(HW_LMEM_PCCSAR_ADDR, BP_LMEM_PCCSAR_LGO))
#endif

//! @brief Format value for bitfield LMEM_PCCSAR_LGO.
#define BF_LMEM_PCCSAR_LGO(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCSAR_LGO), uint32_t) & BM_LMEM_PCCSAR_LGO)

#ifndef __LANGUAGE_ASM__
//! @brief Set the LGO field to a new value.
#define BW_LMEM_PCCSAR_LGO(v) (BITBAND_ACCESS32(HW_LMEM_PCCSAR_ADDR, BP_LMEM_PCCSAR_LGO) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PCCSAR, field PHYADDR[31:2] (RW)
 *
 * PHYADDR represents bits [31:2] of the system address. CSAR[31:12] bits are
 * used for tag compare CSAR[11:4] bits are used to access the tag arrays
 * CSAR[11:2] bits are used to access the data arrays
 */
//@{
#define BP_LMEM_PCCSAR_PHYADDR (2U)        //!< Bit position for LMEM_PCCSAR_PHYADDR.
#define BM_LMEM_PCCSAR_PHYADDR (0xFFFFFFFCU) //!< Bit mask for LMEM_PCCSAR_PHYADDR.
#define BS_LMEM_PCCSAR_PHYADDR (30U)       //!< Bit field size in bits for LMEM_PCCSAR_PHYADDR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCSAR_PHYADDR field.
#define BR_LMEM_PCCSAR_PHYADDR (HW_LMEM_PCCSAR.B.PHYADDR)
#endif

//! @brief Format value for bitfield LMEM_PCCSAR_PHYADDR.
#define BF_LMEM_PCCSAR_PHYADDR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCSAR_PHYADDR), uint32_t) & BM_LMEM_PCCSAR_PHYADDR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PHYADDR field to a new value.
#define BW_LMEM_PCCSAR_PHYADDR(v) (HW_LMEM_PCCSAR_WR((HW_LMEM_PCCSAR_RD() & ~BM_LMEM_PCCSAR_PHYADDR) | BF_LMEM_PCCSAR_PHYADDR(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_LMEM_PCCCVR - Cache read/write value register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_LMEM_PCCCVR - Cache read/write value register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CCVR register is used to source write data or return read data for the
 * commands specified in the CLCR register.
 */
typedef union _hw_lmem_pcccvr
{
    uint32_t U;
    struct _hw_lmem_pcccvr_bitfields
    {
        uint32_t DATA : 32;            //!< [31:0] Cache read/write Data
    } B;
} hw_lmem_pcccvr_t;
#endif

/*!
 * @name Constants and macros for entire LMEM_PCCCVR register
 */
//@{
#define HW_LMEM_PCCCVR_ADDR      (REGS_LMEM_BASE + 0xCU)

#ifndef __LANGUAGE_ASM__
#define HW_LMEM_PCCCVR           (*(__IO hw_lmem_pcccvr_t *) HW_LMEM_PCCCVR_ADDR)
#define HW_LMEM_PCCCVR_RD()      (HW_LMEM_PCCCVR.U)
#define HW_LMEM_PCCCVR_WR(v)     (HW_LMEM_PCCCVR.U = (v))
#define HW_LMEM_PCCCVR_SET(v)    (HW_LMEM_PCCCVR_WR(HW_LMEM_PCCCVR_RD() |  (v)))
#define HW_LMEM_PCCCVR_CLR(v)    (HW_LMEM_PCCCVR_WR(HW_LMEM_PCCCVR_RD() & ~(v)))
#define HW_LMEM_PCCCVR_TOG(v)    (HW_LMEM_PCCCVR_WR(HW_LMEM_PCCCVR_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual LMEM_PCCCVR bitfields
 */

/*!
 * @name Register LMEM_PCCCVR, field DATA[31:0] (RW)
 *
 * For tag search, read or write: CCVR[31:12] bits are used for tag array R/W
 * value CCVR[11:4] bits are used for tag set address on reads; unused on writes
 * CCVR[3:2] bits are reserved For data search, read or write: CCVR[31:0] bits are
 * used for data array R/W value
 */
//@{
#define BP_LMEM_PCCCVR_DATA  (0U)          //!< Bit position for LMEM_PCCCVR_DATA.
#define BM_LMEM_PCCCVR_DATA  (0xFFFFFFFFU) //!< Bit mask for LMEM_PCCCVR_DATA.
#define BS_LMEM_PCCCVR_DATA  (32U)         //!< Bit field size in bits for LMEM_PCCCVR_DATA.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCCVR_DATA field.
#define BR_LMEM_PCCCVR_DATA  (HW_LMEM_PCCCVR.B.DATA)
#endif

//! @brief Format value for bitfield LMEM_PCCCVR_DATA.
#define BF_LMEM_PCCCVR_DATA(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCCVR_DATA), uint32_t) & BM_LMEM_PCCCVR_DATA)

#ifndef __LANGUAGE_ASM__
//! @brief Set the DATA field to a new value.
#define BW_LMEM_PCCCVR_DATA(v) (HW_LMEM_PCCCVR_WR((HW_LMEM_PCCCVR_RD() & ~BM_LMEM_PCCCVR_DATA) | BF_LMEM_PCCCVR_DATA(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_LMEM_PCCRMR - Cache regions mode register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_LMEM_PCCRMR - Cache regions mode register (RW)
 *
 * Reset value: 0xAA0FA000U
 *
 * The CRMR register allows you to demote the cache mode of various subregions
 * within the device's memory map. Demoting the cache mode reduces the cache
 * function applied to a memory region from write-back to write-through to
 * non-cacheable. After a region is demoted, its cache mode can only be raised by a reset,
 * which returns it to its default state. To maintain cache coherency, changes to
 * the cache mode should be completed while the address space being changed is
 * not being accessed or the cache is disabled. Before a cache mode change,
 * complete a cache clear all command to push and invalidate any cache entries that may
 * have changed. The address/module assignment of the 16 subregions is
 * device-specific and are detailed in the Chip Configuration section. Some of the regions
 * may not be used (non-cacheable), and some regions may not be capable of
 * write-back.
 */
typedef union _hw_lmem_pccrmr
{
    uint32_t U;
    struct _hw_lmem_pccrmr_bitfields
    {
        uint32_t R15 : 2;              //!< [1:0] Region 15 mode
        uint32_t R14 : 2;              //!< [3:2] Region 14 mode
        uint32_t R13 : 2;              //!< [5:4] Region 13 mode
        uint32_t R12 : 2;              //!< [7:6] Region 12 mode
        uint32_t R11 : 2;              //!< [9:8] Region 11 mode
        uint32_t R10 : 2;              //!< [11:10] Region 10 mode
        uint32_t R9 : 2;               //!< [13:12] Region 9 mode
        uint32_t R8 : 2;               //!< [15:14] Region 8 mode
        uint32_t R7 : 2;               //!< [17:16] Region 7 mode
        uint32_t R6 : 2;               //!< [19:18] Region 6 mode
        uint32_t R5 : 2;               //!< [21:20] Region 5 mode
        uint32_t R4 : 2;               //!< [23:22] Region 4 mode
        uint32_t R3 : 2;               //!< [25:24] Region 3 mode
        uint32_t R2 : 2;               //!< [27:26] Region 2 mode
        uint32_t R1 : 2;               //!< [29:28] Region 1 mode
        uint32_t R0 : 2;               //!< [31:30] Region 0 mode
    } B;
} hw_lmem_pccrmr_t;
#endif

/*!
 * @name Constants and macros for entire LMEM_PCCRMR register
 */
//@{
#define HW_LMEM_PCCRMR_ADDR      (REGS_LMEM_BASE + 0x20U)

#ifndef __LANGUAGE_ASM__
#define HW_LMEM_PCCRMR           (*(__IO hw_lmem_pccrmr_t *) HW_LMEM_PCCRMR_ADDR)
#define HW_LMEM_PCCRMR_RD()      (HW_LMEM_PCCRMR.U)
#define HW_LMEM_PCCRMR_WR(v)     (HW_LMEM_PCCRMR.U = (v))
#define HW_LMEM_PCCRMR_SET(v)    (HW_LMEM_PCCRMR_WR(HW_LMEM_PCCRMR_RD() |  (v)))
#define HW_LMEM_PCCRMR_CLR(v)    (HW_LMEM_PCCRMR_WR(HW_LMEM_PCCRMR_RD() & ~(v)))
#define HW_LMEM_PCCRMR_TOG(v)    (HW_LMEM_PCCRMR_WR(HW_LMEM_PCCRMR_RD() ^  (v)))
#endif
//@}

