ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_lmem.h
/*
 * Constants & macros for individual LMEM_PCCRMR bitfields
 */

/*!
 * @name Register LMEM_PCCRMR, field R15[1:0] (RW)
 *
 * Controls the cache mode for region 15
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R15   (0U)          //!< Bit position for LMEM_PCCRMR_R15.
#define BM_LMEM_PCCRMR_R15   (0x00000003U) //!< Bit mask for LMEM_PCCRMR_R15.
#define BS_LMEM_PCCRMR_R15   (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R15.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R15 field.
#define BR_LMEM_PCCRMR_R15   (HW_LMEM_PCCRMR.B.R15)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R15.
#define BF_LMEM_PCCRMR_R15(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R15), uint32_t) & BM_LMEM_PCCRMR_R15)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R15 field to a new value.
#define BW_LMEM_PCCRMR_R15(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R15) | BF_LMEM_PCCRMR_R15(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R14[3:2] (RW)
 *
 * Controls the cache mode for region 14
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R14   (2U)          //!< Bit position for LMEM_PCCRMR_R14.
#define BM_LMEM_PCCRMR_R14   (0x0000000CU) //!< Bit mask for LMEM_PCCRMR_R14.
#define BS_LMEM_PCCRMR_R14   (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R14.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R14 field.
#define BR_LMEM_PCCRMR_R14   (HW_LMEM_PCCRMR.B.R14)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R14.
#define BF_LMEM_PCCRMR_R14(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R14), uint32_t) & BM_LMEM_PCCRMR_R14)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R14 field to a new value.
#define BW_LMEM_PCCRMR_R14(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R14) | BF_LMEM_PCCRMR_R14(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R13[5:4] (RW)
 *
 * Controls the cache mode for region 13
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R13   (4U)          //!< Bit position for LMEM_PCCRMR_R13.
#define BM_LMEM_PCCRMR_R13   (0x00000030U) //!< Bit mask for LMEM_PCCRMR_R13.
#define BS_LMEM_PCCRMR_R13   (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R13.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R13 field.
#define BR_LMEM_PCCRMR_R13   (HW_LMEM_PCCRMR.B.R13)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R13.
#define BF_LMEM_PCCRMR_R13(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R13), uint32_t) & BM_LMEM_PCCRMR_R13)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R13 field to a new value.
#define BW_LMEM_PCCRMR_R13(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R13) | BF_LMEM_PCCRMR_R13(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R12[7:6] (RW)
 *
 * Controls the cache mode for region 12
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R12   (6U)          //!< Bit position for LMEM_PCCRMR_R12.
#define BM_LMEM_PCCRMR_R12   (0x000000C0U) //!< Bit mask for LMEM_PCCRMR_R12.
#define BS_LMEM_PCCRMR_R12   (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R12.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R12 field.
#define BR_LMEM_PCCRMR_R12   (HW_LMEM_PCCRMR.B.R12)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R12.
#define BF_LMEM_PCCRMR_R12(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R12), uint32_t) & BM_LMEM_PCCRMR_R12)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R12 field to a new value.
#define BW_LMEM_PCCRMR_R12(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R12) | BF_LMEM_PCCRMR_R12(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R11[9:8] (RW)
 *
 * Controls the cache mode for region 11
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R11   (8U)          //!< Bit position for LMEM_PCCRMR_R11.
#define BM_LMEM_PCCRMR_R11   (0x00000300U) //!< Bit mask for LMEM_PCCRMR_R11.
#define BS_LMEM_PCCRMR_R11   (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R11.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R11 field.
#define BR_LMEM_PCCRMR_R11   (HW_LMEM_PCCRMR.B.R11)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R11.
#define BF_LMEM_PCCRMR_R11(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R11), uint32_t) & BM_LMEM_PCCRMR_R11)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R11 field to a new value.
#define BW_LMEM_PCCRMR_R11(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R11) | BF_LMEM_PCCRMR_R11(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R10[11:10] (RW)
 *
 * Controls the cache mode for region 10
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R10   (10U)         //!< Bit position for LMEM_PCCRMR_R10.
#define BM_LMEM_PCCRMR_R10   (0x00000C00U) //!< Bit mask for LMEM_PCCRMR_R10.
#define BS_LMEM_PCCRMR_R10   (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R10.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R10 field.
#define BR_LMEM_PCCRMR_R10   (HW_LMEM_PCCRMR.B.R10)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R10.
#define BF_LMEM_PCCRMR_R10(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R10), uint32_t) & BM_LMEM_PCCRMR_R10)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R10 field to a new value.
#define BW_LMEM_PCCRMR_R10(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R10) | BF_LMEM_PCCRMR_R10(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R9[13:12] (RW)
 *
 * Controls the cache mode for region 9
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R9    (12U)         //!< Bit position for LMEM_PCCRMR_R9.
#define BM_LMEM_PCCRMR_R9    (0x00003000U) //!< Bit mask for LMEM_PCCRMR_R9.
#define BS_LMEM_PCCRMR_R9    (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R9.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R9 field.
#define BR_LMEM_PCCRMR_R9    (HW_LMEM_PCCRMR.B.R9)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R9.
#define BF_LMEM_PCCRMR_R9(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R9), uint32_t) & BM_LMEM_PCCRMR_R9)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R9 field to a new value.
#define BW_LMEM_PCCRMR_R9(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R9) | BF_LMEM_PCCRMR_R9(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R8[15:14] (RW)
 *
 * Controls the cache mode for region 8
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R8    (14U)         //!< Bit position for LMEM_PCCRMR_R8.
#define BM_LMEM_PCCRMR_R8    (0x0000C000U) //!< Bit mask for LMEM_PCCRMR_R8.
#define BS_LMEM_PCCRMR_R8    (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R8.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R8 field.
#define BR_LMEM_PCCRMR_R8    (HW_LMEM_PCCRMR.B.R8)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R8.
#define BF_LMEM_PCCRMR_R8(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R8), uint32_t) & BM_LMEM_PCCRMR_R8)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R8 field to a new value.
#define BW_LMEM_PCCRMR_R8(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R8) | BF_LMEM_PCCRMR_R8(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R7[17:16] (RW)
 *
 * Controls the cache mode for region 7
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R7    (16U)         //!< Bit position for LMEM_PCCRMR_R7.
#define BM_LMEM_PCCRMR_R7    (0x00030000U) //!< Bit mask for LMEM_PCCRMR_R7.
#define BS_LMEM_PCCRMR_R7    (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R7.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R7 field.
#define BR_LMEM_PCCRMR_R7    (HW_LMEM_PCCRMR.B.R7)
#endif

