ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_lmem.h
//! @brief Format value for bitfield LMEM_PCCRMR_R7.
#define BF_LMEM_PCCRMR_R7(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R7), uint32_t) & BM_LMEM_PCCRMR_R7)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R7 field to a new value.
#define BW_LMEM_PCCRMR_R7(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R7) | BF_LMEM_PCCRMR_R7(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R6[19:18] (RW)
 *
 * Controls the cache mode for region 6
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R6    (18U)         //!< Bit position for LMEM_PCCRMR_R6.
#define BM_LMEM_PCCRMR_R6    (0x000C0000U) //!< Bit mask for LMEM_PCCRMR_R6.
#define BS_LMEM_PCCRMR_R6    (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R6.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R6 field.
#define BR_LMEM_PCCRMR_R6    (HW_LMEM_PCCRMR.B.R6)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R6.
#define BF_LMEM_PCCRMR_R6(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R6), uint32_t) & BM_LMEM_PCCRMR_R6)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R6 field to a new value.
#define BW_LMEM_PCCRMR_R6(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R6) | BF_LMEM_PCCRMR_R6(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R5[21:20] (RW)
 *
 * Controls the cache mode for region 5
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R5    (20U)         //!< Bit position for LMEM_PCCRMR_R5.
#define BM_LMEM_PCCRMR_R5    (0x00300000U) //!< Bit mask for LMEM_PCCRMR_R5.
#define BS_LMEM_PCCRMR_R5    (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R5.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R5 field.
#define BR_LMEM_PCCRMR_R5    (HW_LMEM_PCCRMR.B.R5)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R5.
#define BF_LMEM_PCCRMR_R5(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R5), uint32_t) & BM_LMEM_PCCRMR_R5)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R5 field to a new value.
#define BW_LMEM_PCCRMR_R5(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R5) | BF_LMEM_PCCRMR_R5(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R4[23:22] (RW)
 *
 * Controls the cache mode for region 4
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R4    (22U)         //!< Bit position for LMEM_PCCRMR_R4.
#define BM_LMEM_PCCRMR_R4    (0x00C00000U) //!< Bit mask for LMEM_PCCRMR_R4.
#define BS_LMEM_PCCRMR_R4    (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R4.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R4 field.
#define BR_LMEM_PCCRMR_R4    (HW_LMEM_PCCRMR.B.R4)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R4.
#define BF_LMEM_PCCRMR_R4(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R4), uint32_t) & BM_LMEM_PCCRMR_R4)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R4 field to a new value.
#define BW_LMEM_PCCRMR_R4(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R4) | BF_LMEM_PCCRMR_R4(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R3[25:24] (RW)
 *
 * Controls the cache mode for region 3
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R3    (24U)         //!< Bit position for LMEM_PCCRMR_R3.
#define BM_LMEM_PCCRMR_R3    (0x03000000U) //!< Bit mask for LMEM_PCCRMR_R3.
#define BS_LMEM_PCCRMR_R3    (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R3.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R3 field.
#define BR_LMEM_PCCRMR_R3    (HW_LMEM_PCCRMR.B.R3)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R3.
#define BF_LMEM_PCCRMR_R3(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R3), uint32_t) & BM_LMEM_PCCRMR_R3)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R3 field to a new value.
#define BW_LMEM_PCCRMR_R3(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R3) | BF_LMEM_PCCRMR_R3(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R2[27:26] (RW)
 *
 * Controls the cache mode for region 2
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R2    (26U)         //!< Bit position for LMEM_PCCRMR_R2.
#define BM_LMEM_PCCRMR_R2    (0x0C000000U) //!< Bit mask for LMEM_PCCRMR_R2.
#define BS_LMEM_PCCRMR_R2    (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R2.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R2 field.
#define BR_LMEM_PCCRMR_R2    (HW_LMEM_PCCRMR.B.R2)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R2.
#define BF_LMEM_PCCRMR_R2(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R2), uint32_t) & BM_LMEM_PCCRMR_R2)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R2 field to a new value.
#define BW_LMEM_PCCRMR_R2(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R2) | BF_LMEM_PCCRMR_R2(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R1[29:28] (RW)
 *
 * Controls the cache mode for region 1
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R1    (28U)         //!< Bit position for LMEM_PCCRMR_R1.
#define BM_LMEM_PCCRMR_R1    (0x30000000U) //!< Bit mask for LMEM_PCCRMR_R1.
#define BS_LMEM_PCCRMR_R1    (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R1.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R1 field.
#define BR_LMEM_PCCRMR_R1    (HW_LMEM_PCCRMR.B.R1)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R1.
#define BF_LMEM_PCCRMR_R1(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R1), uint32_t) & BM_LMEM_PCCRMR_R1)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R1 field to a new value.
#define BW_LMEM_PCCRMR_R1(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R1) | BF_LMEM_PCCRMR_R1(v)))
#endif
//@}

/*!
 * @name Register LMEM_PCCRMR, field R0[31:30] (RW)
 *
 * Controls the cache mode for region 0
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PCCRMR_R0    (30U)         //!< Bit position for LMEM_PCCRMR_R0.
#define BM_LMEM_PCCRMR_R0    (0xC0000000U) //!< Bit mask for LMEM_PCCRMR_R0.
#define BS_LMEM_PCCRMR_R0    (2U)          //!< Bit field size in bits for LMEM_PCCRMR_R0.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PCCRMR_R0 field.
#define BR_LMEM_PCCRMR_R0    (HW_LMEM_PCCRMR.B.R0)
#endif

//! @brief Format value for bitfield LMEM_PCCRMR_R0.
#define BF_LMEM_PCCRMR_R0(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PCCRMR_R0), uint32_t) & BM_LMEM_PCCRMR_R0)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R0 field to a new value.
#define BW_LMEM_PCCRMR_R0(v) (HW_LMEM_PCCRMR_WR((HW_LMEM_PCCRMR_RD() & ~BM_LMEM_PCCRMR_R0) | BF_LMEM_PCCRMR_R0(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_LMEM_PSCCR - Cache control register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_LMEM_PSCCR - Cache control register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_lmem_psccr
{
    uint32_t U;
    struct _hw_lmem_psccr_bitfields
    {
        uint32_t ENCACHE : 1;          //!< [0] Cache enable
        uint32_t ENWRBUF : 1;          //!< [1] Enable Write Buffer
        uint32_t RESERVED0 : 22;       //!< [23:2]
        uint32_t INVW0 : 1;            //!< [24] Invalidate Way 0
        uint32_t PUSHW0 : 1;           //!< [25] Push Way 0
        uint32_t INVW1 : 1;            //!< [26] Invalidate Way 1
        uint32_t PUSHW1 : 1;           //!< [27] Push Way 1
        uint32_t RESERVED1 : 3;        //!< [30:28]
        uint32_t GO : 1;               //!< [31] Initiate Cache Command
    } B;
} hw_lmem_psccr_t;
#endif

/*!
 * @name Constants and macros for entire LMEM_PSCCR register
 */
//@{
#define HW_LMEM_PSCCR_ADDR       (REGS_LMEM_BASE + 0x800U)

#ifndef __LANGUAGE_ASM__
#define HW_LMEM_PSCCR            (*(__IO hw_lmem_psccr_t *) HW_LMEM_PSCCR_ADDR)
#define HW_LMEM_PSCCR_RD()       (HW_LMEM_PSCCR.U)
#define HW_LMEM_PSCCR_WR(v)      (HW_LMEM_PSCCR.U = (v))
#define HW_LMEM_PSCCR_SET(v)     (HW_LMEM_PSCCR_WR(HW_LMEM_PSCCR_RD() |  (v)))
#define HW_LMEM_PSCCR_CLR(v)     (HW_LMEM_PSCCR_WR(HW_LMEM_PSCCR_RD() & ~(v)))
#define HW_LMEM_PSCCR_TOG(v)     (HW_LMEM_PSCCR_WR(HW_LMEM_PSCCR_RD() ^  (v)))
#endif
//@}

