ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_lmem.h
/*
 * Constants & macros for individual LMEM_PSCCR bitfields
 */

/*!
 * @name Register LMEM_PSCCR, field ENCACHE[0] (RW)
 *
 * Values:
 * - 0 - Cache disabled
 * - 1 - Cache enabled
 */
//@{
#define BP_LMEM_PSCCR_ENCACHE (0U)         //!< Bit position for LMEM_PSCCR_ENCACHE.
#define BM_LMEM_PSCCR_ENCACHE (0x00000001U) //!< Bit mask for LMEM_PSCCR_ENCACHE.
#define BS_LMEM_PSCCR_ENCACHE (1U)         //!< Bit field size in bits for LMEM_PSCCR_ENCACHE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCCR_ENCACHE field.
#define BR_LMEM_PSCCR_ENCACHE (BITBAND_ACCESS32(HW_LMEM_PSCCR_ADDR, BP_LMEM_PSCCR_ENCACHE))
#endif

//! @brief Format value for bitfield LMEM_PSCCR_ENCACHE.
#define BF_LMEM_PSCCR_ENCACHE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCCR_ENCACHE), uint32_t) & BM_LMEM_PSCCR_ENCACHE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ENCACHE field to a new value.
#define BW_LMEM_PSCCR_ENCACHE(v) (BITBAND_ACCESS32(HW_LMEM_PSCCR_ADDR, BP_LMEM_PSCCR_ENCACHE) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PSCCR, field ENWRBUF[1] (RW)
 *
 * Values:
 * - 0 - Write buffer disabled
 * - 1 - Write buffer enabled
 */
//@{
#define BP_LMEM_PSCCR_ENWRBUF (1U)         //!< Bit position for LMEM_PSCCR_ENWRBUF.
#define BM_LMEM_PSCCR_ENWRBUF (0x00000002U) //!< Bit mask for LMEM_PSCCR_ENWRBUF.
#define BS_LMEM_PSCCR_ENWRBUF (1U)         //!< Bit field size in bits for LMEM_PSCCR_ENWRBUF.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCCR_ENWRBUF field.
#define BR_LMEM_PSCCR_ENWRBUF (BITBAND_ACCESS32(HW_LMEM_PSCCR_ADDR, BP_LMEM_PSCCR_ENWRBUF))
#endif

//! @brief Format value for bitfield LMEM_PSCCR_ENWRBUF.
#define BF_LMEM_PSCCR_ENWRBUF(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCCR_ENWRBUF), uint32_t) & BM_LMEM_PSCCR_ENWRBUF)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ENWRBUF field to a new value.
#define BW_LMEM_PSCCR_ENWRBUF(v) (BITBAND_ACCESS32(HW_LMEM_PSCCR_ADDR, BP_LMEM_PSCCR_ENWRBUF) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PSCCR, field INVW0[24] (RW)
 *
 * If the PUSHW0 and INVW0 bits are set, then after setting the GO bit, push all
 * modified lines in way 0 and invalidate all lines in way 0 (clear way 0).
 *
 * Values:
 * - 0 - No operation
 * - 1 - When setting the GO bit, invalidate all lines in way 0.
 */
//@{
#define BP_LMEM_PSCCR_INVW0  (24U)         //!< Bit position for LMEM_PSCCR_INVW0.
#define BM_LMEM_PSCCR_INVW0  (0x01000000U) //!< Bit mask for LMEM_PSCCR_INVW0.
#define BS_LMEM_PSCCR_INVW0  (1U)          //!< Bit field size in bits for LMEM_PSCCR_INVW0.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCCR_INVW0 field.
#define BR_LMEM_PSCCR_INVW0  (BITBAND_ACCESS32(HW_LMEM_PSCCR_ADDR, BP_LMEM_PSCCR_INVW0))
#endif

//! @brief Format value for bitfield LMEM_PSCCR_INVW0.
#define BF_LMEM_PSCCR_INVW0(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCCR_INVW0), uint32_t) & BM_LMEM_PSCCR_INVW0)

#ifndef __LANGUAGE_ASM__
//! @brief Set the INVW0 field to a new value.
#define BW_LMEM_PSCCR_INVW0(v) (BITBAND_ACCESS32(HW_LMEM_PSCCR_ADDR, BP_LMEM_PSCCR_INVW0) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PSCCR, field PUSHW0[25] (RW)
 *
 * Values:
 * - 0 - No operation
 * - 1 - When setting the GO bit, push all modified lines in way 0
 */
//@{
#define BP_LMEM_PSCCR_PUSHW0 (25U)         //!< Bit position for LMEM_PSCCR_PUSHW0.
#define BM_LMEM_PSCCR_PUSHW0 (0x02000000U) //!< Bit mask for LMEM_PSCCR_PUSHW0.
#define BS_LMEM_PSCCR_PUSHW0 (1U)          //!< Bit field size in bits for LMEM_PSCCR_PUSHW0.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCCR_PUSHW0 field.
#define BR_LMEM_PSCCR_PUSHW0 (BITBAND_ACCESS32(HW_LMEM_PSCCR_ADDR, BP_LMEM_PSCCR_PUSHW0))
#endif

//! @brief Format value for bitfield LMEM_PSCCR_PUSHW0.
#define BF_LMEM_PSCCR_PUSHW0(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCCR_PUSHW0), uint32_t) & BM_LMEM_PSCCR_PUSHW0)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PUSHW0 field to a new value.
#define BW_LMEM_PSCCR_PUSHW0(v) (BITBAND_ACCESS32(HW_LMEM_PSCCR_ADDR, BP_LMEM_PSCCR_PUSHW0) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PSCCR, field INVW1[26] (RW)
 *
 * If the PUSHW1 and INVW1 bits are set, then after setting the GO bit, push all
 * modified lines in way 1 and invalidate all lines in way 1 (clear way 1).
 *
 * Values:
 * - 0 - No operation
 * - 1 - When setting the GO bit, invalidate all lines in way 1
 */
//@{
#define BP_LMEM_PSCCR_INVW1  (26U)         //!< Bit position for LMEM_PSCCR_INVW1.
#define BM_LMEM_PSCCR_INVW1  (0x04000000U) //!< Bit mask for LMEM_PSCCR_INVW1.
#define BS_LMEM_PSCCR_INVW1  (1U)          //!< Bit field size in bits for LMEM_PSCCR_INVW1.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCCR_INVW1 field.
#define BR_LMEM_PSCCR_INVW1  (BITBAND_ACCESS32(HW_LMEM_PSCCR_ADDR, BP_LMEM_PSCCR_INVW1))
#endif

//! @brief Format value for bitfield LMEM_PSCCR_INVW1.
#define BF_LMEM_PSCCR_INVW1(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCCR_INVW1), uint32_t) & BM_LMEM_PSCCR_INVW1)

#ifndef __LANGUAGE_ASM__
//! @brief Set the INVW1 field to a new value.
#define BW_LMEM_PSCCR_INVW1(v) (BITBAND_ACCESS32(HW_LMEM_PSCCR_ADDR, BP_LMEM_PSCCR_INVW1) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PSCCR, field PUSHW1[27] (RW)
 *
 * Values:
 * - 0 - No operation
 * - 1 - When setting the GO bit, push all modified lines in way 1
 */
//@{
#define BP_LMEM_PSCCR_PUSHW1 (27U)         //!< Bit position for LMEM_PSCCR_PUSHW1.
#define BM_LMEM_PSCCR_PUSHW1 (0x08000000U) //!< Bit mask for LMEM_PSCCR_PUSHW1.
#define BS_LMEM_PSCCR_PUSHW1 (1U)          //!< Bit field size in bits for LMEM_PSCCR_PUSHW1.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCCR_PUSHW1 field.
#define BR_LMEM_PSCCR_PUSHW1 (BITBAND_ACCESS32(HW_LMEM_PSCCR_ADDR, BP_LMEM_PSCCR_PUSHW1))
#endif

//! @brief Format value for bitfield LMEM_PSCCR_PUSHW1.
#define BF_LMEM_PSCCR_PUSHW1(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCCR_PUSHW1), uint32_t) & BM_LMEM_PSCCR_PUSHW1)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PUSHW1 field to a new value.
#define BW_LMEM_PSCCR_PUSHW1(v) (BITBAND_ACCESS32(HW_LMEM_PSCCR_ADDR, BP_LMEM_PSCCR_PUSHW1) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PSCCR, field GO[31] (RW)
 *
 * Setting this bit initiates the cache command indicated by bits 27-24. Reading
 * this bit indicates if a command is active This bit stays set until the
 * command completes. Writing zero has no effect.
 *
 * Values:
 * - 0 - Write: no effect. Read: no cache command active.
 * - 1 - Write: initiate command indicated by bits 27-24. Read: cache command
 *     active.
 */
//@{
#define BP_LMEM_PSCCR_GO     (31U)         //!< Bit position for LMEM_PSCCR_GO.
#define BM_LMEM_PSCCR_GO     (0x80000000U) //!< Bit mask for LMEM_PSCCR_GO.
#define BS_LMEM_PSCCR_GO     (1U)          //!< Bit field size in bits for LMEM_PSCCR_GO.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCCR_GO field.
#define BR_LMEM_PSCCR_GO     (BITBAND_ACCESS32(HW_LMEM_PSCCR_ADDR, BP_LMEM_PSCCR_GO))
#endif

//! @brief Format value for bitfield LMEM_PSCCR_GO.
#define BF_LMEM_PSCCR_GO(v)  (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCCR_GO), uint32_t) & BM_LMEM_PSCCR_GO)

#ifndef __LANGUAGE_ASM__
//! @brief Set the GO field to a new value.
#define BW_LMEM_PSCCR_GO(v)  (BITBAND_ACCESS32(HW_LMEM_PSCCR_ADDR, BP_LMEM_PSCCR_GO) = (v))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_LMEM_PSCLCR - Cache line control register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_LMEM_PSCLCR - Cache line control register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines specific line-sized cache operations to be performed
 * using a specific cache line address or a physical address. If a physical address
 * is specified, both ways of the cache are searched, and the command is only
 * performed on the way which hits.
 */
typedef union _hw_lmem_psclcr
{
    uint32_t U;
    struct _hw_lmem_psclcr_bitfields
    {
        uint32_t LGO : 1;              //!< [0] Initiate Cache Line Command
        uint32_t RESERVED0 : 1;        //!< [1]
        uint32_t CACHEADDR : 10;       //!< [11:2] Cache address
        uint32_t RESERVED1 : 2;        //!< [13:12]
        uint32_t WSEL : 1;             //!< [14] Way select
        uint32_t RESERVED2 : 1;        //!< [15]
        uint32_t TDSEL : 1;            //!< [16] Tag/Data Select
        uint32_t RESERVED3 : 3;        //!< [19:17]
        uint32_t LCIVB : 1;            //!< [20] Line Command Initial Valid Bit
        uint32_t LCIMB : 1;            //!< [21] Line Command Initial Modified Bit
        uint32_t LCWAY : 1;            //!< [22] Line Command Way
        uint32_t RESERVED4 : 1;        //!< [23]
        uint32_t LCMD : 2;             //!< [25:24] Line Command
        uint32_t LADSEL : 1;           //!< [26] Line Address Select
        uint32_t LACC : 1;             //!< [27] Line access type
        uint32_t RESERVED5 : 4;        //!< [31:28]
    } B;
} hw_lmem_psclcr_t;
#endif

/*!
 * @name Constants and macros for entire LMEM_PSCLCR register
 */
//@{
#define HW_LMEM_PSCLCR_ADDR      (REGS_LMEM_BASE + 0x804U)

#ifndef __LANGUAGE_ASM__
#define HW_LMEM_PSCLCR           (*(__IO hw_lmem_psclcr_t *) HW_LMEM_PSCLCR_ADDR)
#define HW_LMEM_PSCLCR_RD()      (HW_LMEM_PSCLCR.U)
#define HW_LMEM_PSCLCR_WR(v)     (HW_LMEM_PSCLCR.U = (v))
#define HW_LMEM_PSCLCR_SET(v)    (HW_LMEM_PSCLCR_WR(HW_LMEM_PSCLCR_RD() |  (v)))
#define HW_LMEM_PSCLCR_CLR(v)    (HW_LMEM_PSCLCR_WR(HW_LMEM_PSCLCR_RD() & ~(v)))
#define HW_LMEM_PSCLCR_TOG(v)    (HW_LMEM_PSCLCR_WR(HW_LMEM_PSCLCR_RD() ^  (v)))
#endif
//@}

