ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_lmem.h
/*
 * Constants & macros for individual LMEM_PSCLCR bitfields
 */

/*!
 * @name Register LMEM_PSCLCR, field LGO[0] (RW)
 *
 * Setting this bit initiates the cache line command indicated by bits 27-24.
 * Reading this bit indicates if a line command is active This bit stays set until
 * the command completes. Writing zero has no effect. This bit is shared with
 * CSAR[LGO]
 *
 * Values:
 * - 0 - Write: no effect. Read: no line command active.
 * - 1 - Write: initiate line command indicated by bits 27-24. Read: line
 *     command active.
 */
//@{
#define BP_LMEM_PSCLCR_LGO   (0U)          //!< Bit position for LMEM_PSCLCR_LGO.
#define BM_LMEM_PSCLCR_LGO   (0x00000001U) //!< Bit mask for LMEM_PSCLCR_LGO.
#define BS_LMEM_PSCLCR_LGO   (1U)          //!< Bit field size in bits for LMEM_PSCLCR_LGO.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCLCR_LGO field.
#define BR_LMEM_PSCLCR_LGO   (BITBAND_ACCESS32(HW_LMEM_PSCLCR_ADDR, BP_LMEM_PSCLCR_LGO))
#endif

//! @brief Format value for bitfield LMEM_PSCLCR_LGO.
#define BF_LMEM_PSCLCR_LGO(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCLCR_LGO), uint32_t) & BM_LMEM_PSCLCR_LGO)

#ifndef __LANGUAGE_ASM__
//! @brief Set the LGO field to a new value.
#define BW_LMEM_PSCLCR_LGO(v) (BITBAND_ACCESS32(HW_LMEM_PSCLCR_ADDR, BP_LMEM_PSCLCR_LGO) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PSCLCR, field CACHEADDR[11:2] (RW)
 *
 * CLCR[11:4] bits are used to access the tag arrays CLCR[11:2] bits are used to
 * access the data arrays
 */
//@{
#define BP_LMEM_PSCLCR_CACHEADDR (2U)      //!< Bit position for LMEM_PSCLCR_CACHEADDR.
#define BM_LMEM_PSCLCR_CACHEADDR (0x00000FFCU) //!< Bit mask for LMEM_PSCLCR_CACHEADDR.
#define BS_LMEM_PSCLCR_CACHEADDR (10U)     //!< Bit field size in bits for LMEM_PSCLCR_CACHEADDR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCLCR_CACHEADDR field.
#define BR_LMEM_PSCLCR_CACHEADDR (HW_LMEM_PSCLCR.B.CACHEADDR)
#endif

//! @brief Format value for bitfield LMEM_PSCLCR_CACHEADDR.
#define BF_LMEM_PSCLCR_CACHEADDR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCLCR_CACHEADDR), uint32_t) & BM_LMEM_PSCLCR_CACHEADDR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the CACHEADDR field to a new value.
#define BW_LMEM_PSCLCR_CACHEADDR(v) (HW_LMEM_PSCLCR_WR((HW_LMEM_PSCLCR_RD() & ~BM_LMEM_PSCLCR_CACHEADDR) | BF_LMEM_PSCLCR_CACHEADDR(v)))
#endif
//@}

/*!
 * @name Register LMEM_PSCLCR, field WSEL[14] (RW)
 *
 * Selects the way for line commands.
 *
 * Values:
 * - 0 - Way 0
 * - 1 - Way 1
 */
//@{
#define BP_LMEM_PSCLCR_WSEL  (14U)         //!< Bit position for LMEM_PSCLCR_WSEL.
#define BM_LMEM_PSCLCR_WSEL  (0x00004000U) //!< Bit mask for LMEM_PSCLCR_WSEL.
#define BS_LMEM_PSCLCR_WSEL  (1U)          //!< Bit field size in bits for LMEM_PSCLCR_WSEL.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCLCR_WSEL field.
#define BR_LMEM_PSCLCR_WSEL  (BITBAND_ACCESS32(HW_LMEM_PSCLCR_ADDR, BP_LMEM_PSCLCR_WSEL))
#endif

//! @brief Format value for bitfield LMEM_PSCLCR_WSEL.
#define BF_LMEM_PSCLCR_WSEL(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCLCR_WSEL), uint32_t) & BM_LMEM_PSCLCR_WSEL)

#ifndef __LANGUAGE_ASM__
//! @brief Set the WSEL field to a new value.
#define BW_LMEM_PSCLCR_WSEL(v) (BITBAND_ACCESS32(HW_LMEM_PSCLCR_ADDR, BP_LMEM_PSCLCR_WSEL) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PSCLCR, field TDSEL[16] (RW)
 *
 * Selects tag or data for search and read or write commands.
 *
 * Values:
 * - 0 - Data
 * - 1 - Tag
 */
//@{
#define BP_LMEM_PSCLCR_TDSEL (16U)         //!< Bit position for LMEM_PSCLCR_TDSEL.
#define BM_LMEM_PSCLCR_TDSEL (0x00010000U) //!< Bit mask for LMEM_PSCLCR_TDSEL.
#define BS_LMEM_PSCLCR_TDSEL (1U)          //!< Bit field size in bits for LMEM_PSCLCR_TDSEL.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCLCR_TDSEL field.
#define BR_LMEM_PSCLCR_TDSEL (BITBAND_ACCESS32(HW_LMEM_PSCLCR_ADDR, BP_LMEM_PSCLCR_TDSEL))
#endif

//! @brief Format value for bitfield LMEM_PSCLCR_TDSEL.
#define BF_LMEM_PSCLCR_TDSEL(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCLCR_TDSEL), uint32_t) & BM_LMEM_PSCLCR_TDSEL)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TDSEL field to a new value.
#define BW_LMEM_PSCLCR_TDSEL(v) (BITBAND_ACCESS32(HW_LMEM_PSCLCR_ADDR, BP_LMEM_PSCLCR_TDSEL) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PSCLCR, field LCIVB[20] (RO)
 *
 * If command used cache address and way, then this bit shows the initial state
 * of the valid bit If command used physical address and a hit, then this bit
 * shows the initial state of the valid bit. If a miss, this bit reads zero.
 */
//@{
#define BP_LMEM_PSCLCR_LCIVB (20U)         //!< Bit position for LMEM_PSCLCR_LCIVB.
#define BM_LMEM_PSCLCR_LCIVB (0x00100000U) //!< Bit mask for LMEM_PSCLCR_LCIVB.
#define BS_LMEM_PSCLCR_LCIVB (1U)          //!< Bit field size in bits for LMEM_PSCLCR_LCIVB.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCLCR_LCIVB field.
#define BR_LMEM_PSCLCR_LCIVB (BITBAND_ACCESS32(HW_LMEM_PSCLCR_ADDR, BP_LMEM_PSCLCR_LCIVB))
#endif
//@}

/*!
 * @name Register LMEM_PSCLCR, field LCIMB[21] (RO)
 *
 * If command used cache address and way, then this bit shows the initial state
 * of the modified bit If command used physical address and a hit, then this bit
 * shows the initial state of the modified bit. If a miss, this bit reads zero.
 */
//@{
#define BP_LMEM_PSCLCR_LCIMB (21U)         //!< Bit position for LMEM_PSCLCR_LCIMB.
#define BM_LMEM_PSCLCR_LCIMB (0x00200000U) //!< Bit mask for LMEM_PSCLCR_LCIMB.
#define BS_LMEM_PSCLCR_LCIMB (1U)          //!< Bit field size in bits for LMEM_PSCLCR_LCIMB.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCLCR_LCIMB field.
#define BR_LMEM_PSCLCR_LCIMB (BITBAND_ACCESS32(HW_LMEM_PSCLCR_ADDR, BP_LMEM_PSCLCR_LCIMB))
#endif
//@}

/*!
 * @name Register LMEM_PSCLCR, field LCWAY[22] (RO)
 *
 * Indicates the way used by the line command.
 */
//@{
#define BP_LMEM_PSCLCR_LCWAY (22U)         //!< Bit position for LMEM_PSCLCR_LCWAY.
#define BM_LMEM_PSCLCR_LCWAY (0x00400000U) //!< Bit mask for LMEM_PSCLCR_LCWAY.
#define BS_LMEM_PSCLCR_LCWAY (1U)          //!< Bit field size in bits for LMEM_PSCLCR_LCWAY.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCLCR_LCWAY field.
#define BR_LMEM_PSCLCR_LCWAY (BITBAND_ACCESS32(HW_LMEM_PSCLCR_ADDR, BP_LMEM_PSCLCR_LCWAY))
#endif
//@}

/*!
 * @name Register LMEM_PSCLCR, field LCMD[25:24] (RW)
 *
 * Values:
 * - 00 - Search and read or write
 * - 01 - Invalidate
 * - 10 - Push
 * - 11 - Clear
 */
//@{
#define BP_LMEM_PSCLCR_LCMD  (24U)         //!< Bit position for LMEM_PSCLCR_LCMD.
#define BM_LMEM_PSCLCR_LCMD  (0x03000000U) //!< Bit mask for LMEM_PSCLCR_LCMD.
#define BS_LMEM_PSCLCR_LCMD  (2U)          //!< Bit field size in bits for LMEM_PSCLCR_LCMD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCLCR_LCMD field.
#define BR_LMEM_PSCLCR_LCMD  (HW_LMEM_PSCLCR.B.LCMD)
#endif

//! @brief Format value for bitfield LMEM_PSCLCR_LCMD.
#define BF_LMEM_PSCLCR_LCMD(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCLCR_LCMD), uint32_t) & BM_LMEM_PSCLCR_LCMD)

#ifndef __LANGUAGE_ASM__
//! @brief Set the LCMD field to a new value.
#define BW_LMEM_PSCLCR_LCMD(v) (HW_LMEM_PSCLCR_WR((HW_LMEM_PSCLCR_RD() & ~BM_LMEM_PSCLCR_LCMD) | BF_LMEM_PSCLCR_LCMD(v)))
#endif
//@}

/*!
 * @name Register LMEM_PSCLCR, field LADSEL[26] (RW)
 *
 * When using the cache address, the way must also be specified in CLCR[WSEL].
 * When using the physical address, both ways are searched and the command is
 * performed only if a hit.
 *
 * Values:
 * - 0 - Cache address
 * - 1 - Physical address
 */
//@{
#define BP_LMEM_PSCLCR_LADSEL (26U)        //!< Bit position for LMEM_PSCLCR_LADSEL.
#define BM_LMEM_PSCLCR_LADSEL (0x04000000U) //!< Bit mask for LMEM_PSCLCR_LADSEL.
#define BS_LMEM_PSCLCR_LADSEL (1U)         //!< Bit field size in bits for LMEM_PSCLCR_LADSEL.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCLCR_LADSEL field.
#define BR_LMEM_PSCLCR_LADSEL (BITBAND_ACCESS32(HW_LMEM_PSCLCR_ADDR, BP_LMEM_PSCLCR_LADSEL))
#endif

