ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_lmem.h
//! @brief Format value for bitfield LMEM_PSCLCR_LADSEL.
#define BF_LMEM_PSCLCR_LADSEL(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCLCR_LADSEL), uint32_t) & BM_LMEM_PSCLCR_LADSEL)

#ifndef __LANGUAGE_ASM__
//! @brief Set the LADSEL field to a new value.
#define BW_LMEM_PSCLCR_LADSEL(v) (BITBAND_ACCESS32(HW_LMEM_PSCLCR_ADDR, BP_LMEM_PSCLCR_LADSEL) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PSCLCR, field LACC[27] (RW)
 *
 * Values:
 * - 0 - Read
 * - 1 - Write
 */
//@{
#define BP_LMEM_PSCLCR_LACC  (27U)         //!< Bit position for LMEM_PSCLCR_LACC.
#define BM_LMEM_PSCLCR_LACC  (0x08000000U) //!< Bit mask for LMEM_PSCLCR_LACC.
#define BS_LMEM_PSCLCR_LACC  (1U)          //!< Bit field size in bits for LMEM_PSCLCR_LACC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCLCR_LACC field.
#define BR_LMEM_PSCLCR_LACC  (BITBAND_ACCESS32(HW_LMEM_PSCLCR_ADDR, BP_LMEM_PSCLCR_LACC))
#endif

//! @brief Format value for bitfield LMEM_PSCLCR_LACC.
#define BF_LMEM_PSCLCR_LACC(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCLCR_LACC), uint32_t) & BM_LMEM_PSCLCR_LACC)

#ifndef __LANGUAGE_ASM__
//! @brief Set the LACC field to a new value.
#define BW_LMEM_PSCLCR_LACC(v) (BITBAND_ACCESS32(HW_LMEM_PSCLCR_ADDR, BP_LMEM_PSCLCR_LACC) = (v))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_LMEM_PSCSAR - Cache search address register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_LMEM_PSCSAR - Cache search address register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CSAR register is used to define the explicit cache address or the
 * physical address for line-sized commands specified in the CLCR[LADSEL] bit.
 */
typedef union _hw_lmem_pscsar
{
    uint32_t U;
    struct _hw_lmem_pscsar_bitfields
    {
        uint32_t LGO : 1;              //!< [0] Initiate Cache Line Command
        uint32_t RESERVED0 : 1;        //!< [1]
        uint32_t PHYADDR : 30;         //!< [31:2] Physical Address
    } B;
} hw_lmem_pscsar_t;
#endif

/*!
 * @name Constants and macros for entire LMEM_PSCSAR register
 */
//@{
#define HW_LMEM_PSCSAR_ADDR      (REGS_LMEM_BASE + 0x808U)

#ifndef __LANGUAGE_ASM__
#define HW_LMEM_PSCSAR           (*(__IO hw_lmem_pscsar_t *) HW_LMEM_PSCSAR_ADDR)
#define HW_LMEM_PSCSAR_RD()      (HW_LMEM_PSCSAR.U)
#define HW_LMEM_PSCSAR_WR(v)     (HW_LMEM_PSCSAR.U = (v))
#define HW_LMEM_PSCSAR_SET(v)    (HW_LMEM_PSCSAR_WR(HW_LMEM_PSCSAR_RD() |  (v)))
#define HW_LMEM_PSCSAR_CLR(v)    (HW_LMEM_PSCSAR_WR(HW_LMEM_PSCSAR_RD() & ~(v)))
#define HW_LMEM_PSCSAR_TOG(v)    (HW_LMEM_PSCSAR_WR(HW_LMEM_PSCSAR_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual LMEM_PSCSAR bitfields
 */

/*!
 * @name Register LMEM_PSCSAR, field LGO[0] (RW)
 *
 * Setting this bit initiates the cache line command indicated by bits 27-24.
 * Reading this bit indicates if a line command is active This bit stays set until
 * the command completes. Writing zero has no effect. This bit is shared with
 * CLCR[LGO]
 *
 * Values:
 * - 0 - Write: no effect. Read: no line command active.
 * - 1 - Write: initiate line command indicated by bits CLCR[27:24]. Read: line
 *     command active.
 */
//@{
#define BP_LMEM_PSCSAR_LGO   (0U)          //!< Bit position for LMEM_PSCSAR_LGO.
#define BM_LMEM_PSCSAR_LGO   (0x00000001U) //!< Bit mask for LMEM_PSCSAR_LGO.
#define BS_LMEM_PSCSAR_LGO   (1U)          //!< Bit field size in bits for LMEM_PSCSAR_LGO.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCSAR_LGO field.
#define BR_LMEM_PSCSAR_LGO   (BITBAND_ACCESS32(HW_LMEM_PSCSAR_ADDR, BP_LMEM_PSCSAR_LGO))
#endif

//! @brief Format value for bitfield LMEM_PSCSAR_LGO.
#define BF_LMEM_PSCSAR_LGO(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCSAR_LGO), uint32_t) & BM_LMEM_PSCSAR_LGO)

#ifndef __LANGUAGE_ASM__
//! @brief Set the LGO field to a new value.
#define BW_LMEM_PSCSAR_LGO(v) (BITBAND_ACCESS32(HW_LMEM_PSCSAR_ADDR, BP_LMEM_PSCSAR_LGO) = (v))
#endif
//@}

/*!
 * @name Register LMEM_PSCSAR, field PHYADDR[31:2] (RW)
 *
 * PHYADDR represents bits [31:2] of the system address. CSAR[31:12] bits are
 * used for tag compare CSAR[11:4] bits are used to access the tag arrays
 * CSAR[11:2] bits are used to access the data arrays
 */
//@{
#define BP_LMEM_PSCSAR_PHYADDR (2U)        //!< Bit position for LMEM_PSCSAR_PHYADDR.
#define BM_LMEM_PSCSAR_PHYADDR (0xFFFFFFFCU) //!< Bit mask for LMEM_PSCSAR_PHYADDR.
#define BS_LMEM_PSCSAR_PHYADDR (30U)       //!< Bit field size in bits for LMEM_PSCSAR_PHYADDR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCSAR_PHYADDR field.
#define BR_LMEM_PSCSAR_PHYADDR (HW_LMEM_PSCSAR.B.PHYADDR)
#endif

//! @brief Format value for bitfield LMEM_PSCSAR_PHYADDR.
#define BF_LMEM_PSCSAR_PHYADDR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCSAR_PHYADDR), uint32_t) & BM_LMEM_PSCSAR_PHYADDR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PHYADDR field to a new value.
#define BW_LMEM_PSCSAR_PHYADDR(v) (HW_LMEM_PSCSAR_WR((HW_LMEM_PSCSAR_RD() & ~BM_LMEM_PSCSAR_PHYADDR) | BF_LMEM_PSCSAR_PHYADDR(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_LMEM_PSCCVR - Cache read/write value register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_LMEM_PSCCVR - Cache read/write value register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CCVR register is used to source write data or return read data for the
 * commands specified in the CLCR register.
 */
typedef union _hw_lmem_psccvr
{
    uint32_t U;
    struct _hw_lmem_psccvr_bitfields
    {
        uint32_t DATA : 32;            //!< [31:0] Cache read/write Data
    } B;
} hw_lmem_psccvr_t;
#endif

/*!
 * @name Constants and macros for entire LMEM_PSCCVR register
 */
//@{
#define HW_LMEM_PSCCVR_ADDR      (REGS_LMEM_BASE + 0x80CU)

#ifndef __LANGUAGE_ASM__
#define HW_LMEM_PSCCVR           (*(__IO hw_lmem_psccvr_t *) HW_LMEM_PSCCVR_ADDR)
#define HW_LMEM_PSCCVR_RD()      (HW_LMEM_PSCCVR.U)
#define HW_LMEM_PSCCVR_WR(v)     (HW_LMEM_PSCCVR.U = (v))
#define HW_LMEM_PSCCVR_SET(v)    (HW_LMEM_PSCCVR_WR(HW_LMEM_PSCCVR_RD() |  (v)))
#define HW_LMEM_PSCCVR_CLR(v)    (HW_LMEM_PSCCVR_WR(HW_LMEM_PSCCVR_RD() & ~(v)))
#define HW_LMEM_PSCCVR_TOG(v)    (HW_LMEM_PSCCVR_WR(HW_LMEM_PSCCVR_RD() ^  (v)))
#endif
//@}

