ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_lmem.h
/*
 * Constants & macros for individual LMEM_PSCCVR bitfields
 */

/*!
 * @name Register LMEM_PSCCVR, field DATA[31:0] (RW)
 *
 * For tag search, read or write: CCVR[31:12] bits are used for tag array R/W
 * value CCVR[11:4] bits are used for tag set address on reads; unused on writes
 * CCVR[3:2] bits are reserved For data search, read or write: CCVR[31:0] bits are
 * used for data array R/W value
 */
//@{
#define BP_LMEM_PSCCVR_DATA  (0U)          //!< Bit position for LMEM_PSCCVR_DATA.
#define BM_LMEM_PSCCVR_DATA  (0xFFFFFFFFU) //!< Bit mask for LMEM_PSCCVR_DATA.
#define BS_LMEM_PSCCVR_DATA  (32U)         //!< Bit field size in bits for LMEM_PSCCVR_DATA.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCCVR_DATA field.
#define BR_LMEM_PSCCVR_DATA  (HW_LMEM_PSCCVR.B.DATA)
#endif

//! @brief Format value for bitfield LMEM_PSCCVR_DATA.
#define BF_LMEM_PSCCVR_DATA(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCCVR_DATA), uint32_t) & BM_LMEM_PSCCVR_DATA)

#ifndef __LANGUAGE_ASM__
//! @brief Set the DATA field to a new value.
#define BW_LMEM_PSCCVR_DATA(v) (HW_LMEM_PSCCVR_WR((HW_LMEM_PSCCVR_RD() & ~BM_LMEM_PSCCVR_DATA) | BF_LMEM_PSCCVR_DATA(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_LMEM_PSCRMR - Cache regions mode register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_LMEM_PSCRMR - Cache regions mode register (RW)
 *
 * Reset value: 0xAA0FA000U
 *
 * The CRMR register allows you to demote the cache mode of various subregions
 * within the device's memory map. Demoting the cache mode reduces the cache
 * function applied to a memory region from write-back to write-through to
 * non-cacheable. After a region is demoted, its cache mode can only be raised by a reset,
 * which returns it to its default state. To maintain cache coherency, changes to
 * the cache mode should be completed while the address space being changed is
 * not being accessed or the cache is disabled. Before a cache mode change,
 * complete a cache clear all command to push and invalidate any cache entries that may
 * have changed. The address/module assignment of the 16 subregions is
 * device-specific and are detailed in the Chip Configuration section. Some of the regions
 * may not be used (non-cacheable), and some regions may not be capable of
 * write-back.
 */
typedef union _hw_lmem_pscrmr
{
    uint32_t U;
    struct _hw_lmem_pscrmr_bitfields
    {
        uint32_t R15 : 2;              //!< [1:0] Region 15 mode
        uint32_t R14 : 2;              //!< [3:2] Region 14 mode
        uint32_t R13 : 2;              //!< [5:4] Region 13 mode
        uint32_t R12 : 2;              //!< [7:6] Region 12 mode
        uint32_t R11 : 2;              //!< [9:8] Region 11 mode
        uint32_t R10 : 2;              //!< [11:10] Region 10 mode
        uint32_t R9 : 2;               //!< [13:12] Region 9 mode
        uint32_t R8 : 2;               //!< [15:14] Region 8 mode
        uint32_t R7 : 2;               //!< [17:16] Region 7 mode
        uint32_t R6 : 2;               //!< [19:18] Region 6 mode
        uint32_t R5 : 2;               //!< [21:20] Region 5 mode
        uint32_t R4 : 2;               //!< [23:22] Region 4 mode
        uint32_t R3 : 2;               //!< [25:24] Region 3 mode
        uint32_t R2 : 2;               //!< [27:26] Region 2 mode
        uint32_t R1 : 2;               //!< [29:28] Region 1 mode
        uint32_t R0 : 2;               //!< [31:30] Region 0 mode
    } B;
} hw_lmem_pscrmr_t;
#endif

/*!
 * @name Constants and macros for entire LMEM_PSCRMR register
 */
//@{
#define HW_LMEM_PSCRMR_ADDR      (REGS_LMEM_BASE + 0x820U)

#ifndef __LANGUAGE_ASM__
#define HW_LMEM_PSCRMR           (*(__IO hw_lmem_pscrmr_t *) HW_LMEM_PSCRMR_ADDR)
#define HW_LMEM_PSCRMR_RD()      (HW_LMEM_PSCRMR.U)
#define HW_LMEM_PSCRMR_WR(v)     (HW_LMEM_PSCRMR.U = (v))
#define HW_LMEM_PSCRMR_SET(v)    (HW_LMEM_PSCRMR_WR(HW_LMEM_PSCRMR_RD() |  (v)))
#define HW_LMEM_PSCRMR_CLR(v)    (HW_LMEM_PSCRMR_WR(HW_LMEM_PSCRMR_RD() & ~(v)))
#define HW_LMEM_PSCRMR_TOG(v)    (HW_LMEM_PSCRMR_WR(HW_LMEM_PSCRMR_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual LMEM_PSCRMR bitfields
 */

/*!
 * @name Register LMEM_PSCRMR, field R15[1:0] (RW)
 *
 * Controls the cache mode for region 15
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PSCRMR_R15   (0U)          //!< Bit position for LMEM_PSCRMR_R15.
#define BM_LMEM_PSCRMR_R15   (0x00000003U) //!< Bit mask for LMEM_PSCRMR_R15.
#define BS_LMEM_PSCRMR_R15   (2U)          //!< Bit field size in bits for LMEM_PSCRMR_R15.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCRMR_R15 field.
#define BR_LMEM_PSCRMR_R15   (HW_LMEM_PSCRMR.B.R15)
#endif

//! @brief Format value for bitfield LMEM_PSCRMR_R15.
#define BF_LMEM_PSCRMR_R15(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCRMR_R15), uint32_t) & BM_LMEM_PSCRMR_R15)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R15 field to a new value.
#define BW_LMEM_PSCRMR_R15(v) (HW_LMEM_PSCRMR_WR((HW_LMEM_PSCRMR_RD() & ~BM_LMEM_PSCRMR_R15) | BF_LMEM_PSCRMR_R15(v)))
#endif
//@}

/*!
 * @name Register LMEM_PSCRMR, field R14[3:2] (RW)
 *
 * Controls the cache mode for region 14
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PSCRMR_R14   (2U)          //!< Bit position for LMEM_PSCRMR_R14.
#define BM_LMEM_PSCRMR_R14   (0x0000000CU) //!< Bit mask for LMEM_PSCRMR_R14.
#define BS_LMEM_PSCRMR_R14   (2U)          //!< Bit field size in bits for LMEM_PSCRMR_R14.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCRMR_R14 field.
#define BR_LMEM_PSCRMR_R14   (HW_LMEM_PSCRMR.B.R14)
#endif

//! @brief Format value for bitfield LMEM_PSCRMR_R14.
#define BF_LMEM_PSCRMR_R14(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCRMR_R14), uint32_t) & BM_LMEM_PSCRMR_R14)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R14 field to a new value.
#define BW_LMEM_PSCRMR_R14(v) (HW_LMEM_PSCRMR_WR((HW_LMEM_PSCRMR_RD() & ~BM_LMEM_PSCRMR_R14) | BF_LMEM_PSCRMR_R14(v)))
#endif
//@}

/*!
 * @name Register LMEM_PSCRMR, field R13[5:4] (RW)
 *
 * Controls the cache mode for region 13
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PSCRMR_R13   (4U)          //!< Bit position for LMEM_PSCRMR_R13.
#define BM_LMEM_PSCRMR_R13   (0x00000030U) //!< Bit mask for LMEM_PSCRMR_R13.
#define BS_LMEM_PSCRMR_R13   (2U)          //!< Bit field size in bits for LMEM_PSCRMR_R13.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCRMR_R13 field.
#define BR_LMEM_PSCRMR_R13   (HW_LMEM_PSCRMR.B.R13)
#endif

