ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_lmem.h
//! @brief Format value for bitfield LMEM_PSCRMR_R6.
#define BF_LMEM_PSCRMR_R6(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCRMR_R6), uint32_t) & BM_LMEM_PSCRMR_R6)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R6 field to a new value.
#define BW_LMEM_PSCRMR_R6(v) (HW_LMEM_PSCRMR_WR((HW_LMEM_PSCRMR_RD() & ~BM_LMEM_PSCRMR_R6) | BF_LMEM_PSCRMR_R6(v)))
#endif
//@}

/*!
 * @name Register LMEM_PSCRMR, field R5[21:20] (RW)
 *
 * Controls the cache mode for region 5
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PSCRMR_R5    (20U)         //!< Bit position for LMEM_PSCRMR_R5.
#define BM_LMEM_PSCRMR_R5    (0x00300000U) //!< Bit mask for LMEM_PSCRMR_R5.
#define BS_LMEM_PSCRMR_R5    (2U)          //!< Bit field size in bits for LMEM_PSCRMR_R5.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCRMR_R5 field.
#define BR_LMEM_PSCRMR_R5    (HW_LMEM_PSCRMR.B.R5)
#endif

//! @brief Format value for bitfield LMEM_PSCRMR_R5.
#define BF_LMEM_PSCRMR_R5(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCRMR_R5), uint32_t) & BM_LMEM_PSCRMR_R5)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R5 field to a new value.
#define BW_LMEM_PSCRMR_R5(v) (HW_LMEM_PSCRMR_WR((HW_LMEM_PSCRMR_RD() & ~BM_LMEM_PSCRMR_R5) | BF_LMEM_PSCRMR_R5(v)))
#endif
//@}

/*!
 * @name Register LMEM_PSCRMR, field R4[23:22] (RW)
 *
 * Controls the cache mode for region 4
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PSCRMR_R4    (22U)         //!< Bit position for LMEM_PSCRMR_R4.
#define BM_LMEM_PSCRMR_R4    (0x00C00000U) //!< Bit mask for LMEM_PSCRMR_R4.
#define BS_LMEM_PSCRMR_R4    (2U)          //!< Bit field size in bits for LMEM_PSCRMR_R4.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCRMR_R4 field.
#define BR_LMEM_PSCRMR_R4    (HW_LMEM_PSCRMR.B.R4)
#endif

//! @brief Format value for bitfield LMEM_PSCRMR_R4.
#define BF_LMEM_PSCRMR_R4(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCRMR_R4), uint32_t) & BM_LMEM_PSCRMR_R4)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R4 field to a new value.
#define BW_LMEM_PSCRMR_R4(v) (HW_LMEM_PSCRMR_WR((HW_LMEM_PSCRMR_RD() & ~BM_LMEM_PSCRMR_R4) | BF_LMEM_PSCRMR_R4(v)))
#endif
//@}

/*!
 * @name Register LMEM_PSCRMR, field R3[25:24] (RW)
 *
 * Controls the cache mode for region 3
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PSCRMR_R3    (24U)         //!< Bit position for LMEM_PSCRMR_R3.
#define BM_LMEM_PSCRMR_R3    (0x03000000U) //!< Bit mask for LMEM_PSCRMR_R3.
#define BS_LMEM_PSCRMR_R3    (2U)          //!< Bit field size in bits for LMEM_PSCRMR_R3.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCRMR_R3 field.
#define BR_LMEM_PSCRMR_R3    (HW_LMEM_PSCRMR.B.R3)
#endif

//! @brief Format value for bitfield LMEM_PSCRMR_R3.
#define BF_LMEM_PSCRMR_R3(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCRMR_R3), uint32_t) & BM_LMEM_PSCRMR_R3)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R3 field to a new value.
#define BW_LMEM_PSCRMR_R3(v) (HW_LMEM_PSCRMR_WR((HW_LMEM_PSCRMR_RD() & ~BM_LMEM_PSCRMR_R3) | BF_LMEM_PSCRMR_R3(v)))
#endif
//@}

/*!
 * @name Register LMEM_PSCRMR, field R2[27:26] (RW)
 *
 * Controls the cache mode for region 2
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PSCRMR_R2    (26U)         //!< Bit position for LMEM_PSCRMR_R2.
#define BM_LMEM_PSCRMR_R2    (0x0C000000U) //!< Bit mask for LMEM_PSCRMR_R2.
#define BS_LMEM_PSCRMR_R2    (2U)          //!< Bit field size in bits for LMEM_PSCRMR_R2.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCRMR_R2 field.
#define BR_LMEM_PSCRMR_R2    (HW_LMEM_PSCRMR.B.R2)
#endif

//! @brief Format value for bitfield LMEM_PSCRMR_R2.
#define BF_LMEM_PSCRMR_R2(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCRMR_R2), uint32_t) & BM_LMEM_PSCRMR_R2)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R2 field to a new value.
#define BW_LMEM_PSCRMR_R2(v) (HW_LMEM_PSCRMR_WR((HW_LMEM_PSCRMR_RD() & ~BM_LMEM_PSCRMR_R2) | BF_LMEM_PSCRMR_R2(v)))
#endif
//@}

/*!
 * @name Register LMEM_PSCRMR, field R1[29:28] (RW)
 *
 * Controls the cache mode for region 1
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PSCRMR_R1    (28U)         //!< Bit position for LMEM_PSCRMR_R1.
#define BM_LMEM_PSCRMR_R1    (0x30000000U) //!< Bit mask for LMEM_PSCRMR_R1.
#define BS_LMEM_PSCRMR_R1    (2U)          //!< Bit field size in bits for LMEM_PSCRMR_R1.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCRMR_R1 field.
#define BR_LMEM_PSCRMR_R1    (HW_LMEM_PSCRMR.B.R1)
#endif

//! @brief Format value for bitfield LMEM_PSCRMR_R1.
#define BF_LMEM_PSCRMR_R1(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCRMR_R1), uint32_t) & BM_LMEM_PSCRMR_R1)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R1 field to a new value.
#define BW_LMEM_PSCRMR_R1(v) (HW_LMEM_PSCRMR_WR((HW_LMEM_PSCRMR_RD() & ~BM_LMEM_PSCRMR_R1) | BF_LMEM_PSCRMR_R1(v)))
#endif
//@}

/*!
 * @name Register LMEM_PSCRMR, field R0[31:30] (RW)
 *
 * Controls the cache mode for region 0
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
//@{
#define BP_LMEM_PSCRMR_R0    (30U)         //!< Bit position for LMEM_PSCRMR_R0.
#define BM_LMEM_PSCRMR_R0    (0xC0000000U) //!< Bit mask for LMEM_PSCRMR_R0.
#define BS_LMEM_PSCRMR_R0    (2U)          //!< Bit field size in bits for LMEM_PSCRMR_R0.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the LMEM_PSCRMR_R0 field.
#define BR_LMEM_PSCRMR_R0    (HW_LMEM_PSCRMR.B.R0)
#endif

//! @brief Format value for bitfield LMEM_PSCRMR_R0.
#define BF_LMEM_PSCRMR_R0(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_LMEM_PSCRMR_R0), uint32_t) & BM_LMEM_PSCRMR_R0)

#ifndef __LANGUAGE_ASM__
//! @brief Set the R0 field to a new value.
#define BW_LMEM_PSCRMR_R0(v) (HW_LMEM_PSCRMR_WR((HW_LMEM_PSCRMR_RD() & ~BM_LMEM_PSCRMR_R0) | BF_LMEM_PSCRMR_R0(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// hw_lmem_t - module struct
//-------------------------------------------------------------------------------------------
/*!
 * @brief All LMEM module registers.
 */
#ifndef __LANGUAGE_ASM__
#pragma pack(1)
typedef struct _hw_lmem
{
    __IO hw_lmem_pcccr_t PCCCR;            //!< [0x0] Cache control register
    __IO hw_lmem_pcclcr_t PCCLCR;          //!< [0x4] Cache line control register
    __IO hw_lmem_pccsar_t PCCSAR;          //!< [0x8] Cache search address register
    __IO hw_lmem_pcccvr_t PCCCVR;          //!< [0xC] Cache read/write value register
    uint8_t _reserved0[16];
    __IO hw_lmem_pccrmr_t PCCRMR;          //!< [0x20] Cache regions mode register
    uint8_t _reserved1[2012];
    __IO hw_lmem_psccr_t PSCCR;            //!< [0x800] Cache control register
    __IO hw_lmem_psclcr_t PSCLCR;          //!< [0x804] Cache line control register
    __IO hw_lmem_pscsar_t PSCSAR;          //!< [0x808] Cache search address register
    __IO hw_lmem_psccvr_t PSCCVR;          //!< [0x80C] Cache read/write value register
    uint8_t _reserved2[16];
    __IO hw_lmem_pscrmr_t PSCRMR;          //!< [0x820] Cache regions mode register
} hw_lmem_t;
#pragma pack()

//! @brief Macro to access all LMEM registers.
//! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
//!     use the '&' operator, like <code>&HW_LMEM</code>.
#define HW_LMEM        (*(hw_lmem_t *) REGS_LMEM_BASE)
#endif

#endif // __HW_LMEM_REGISTERS_H__
// v22/130726/0.9
// EOF
